Revit 2024 API
RibbonItemData.ToolTipImage Property
The image to show as a part of the button extended tooltip
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public ImageSource ToolTipImage { get; set; }
Visual Basic
Public Property ToolTipImage As ImageSource
	Get
	Set
Visual C++
public:
property ImageSource^ ToolTipImage {
	ImageSource^ get ();
	void set (ImageSource^ value);
}
Remarks
 Shown when the cursor hovers over the command. If neither this property nor LongDescription is supplied, the button will not have an extended tooltip. Maximum height or width is 355 pixels. SplitButton and RadioButtonGroup cannot display the tooltip set by this method. SplitButton shows the current PushButton tooltip and RadioButtonGroup has no tooltip.
See Also
RibbonItemData Class
Autodesk.Revit.UI Namespace